
class Credentials:

    credentials_1 = {
        'name': 'Петр',
        'surname': 'Великий',
        'address': 'улица Усачева, дом 24, кв. 10',
        'metro_station': 'Фрунзенская',
        'phone_number': '+79998884455'
    }

    credentials_2 = {
        'name': 'Дмитрий',
        'surname': 'Медведев',
        'address': 'улица Большая Пионерская, дом 1, кв.8',
        'metro_station': 'Павелецкая',
        'phone_number': '87775553322'
    }


class RentDetails:

    rent_details_1 = {
        'start_date': '21.10.2025',
        'duration': 2,
        'color_black': False,
        'color_grey': True,
        'comment': 'Звонить заранее'
    }

    rent_details_2 = {
        'start_date': '01.12.2025',
        'duration': 4,
        'color_black': True,
        'color_grey': False,
        'comment': 'Нужен чистый самокат'

    }





class Questions:

    answers = [
        [0, 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'],
        [1, 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'],
        [2, 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'],
        [3, 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'],
        [4, 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'],
        [5, 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'],
        [6, 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'],
        [7, 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'],
    ]


    